type TAtoz = {
	title: string;
	description: string;
};

export const Atoz: TAtoz[] = [
	{
		title: '기획',
		description:
			'코드스테이션은 다양한 프로덕트를 다뤄본 경험을 토대로 기획을 진행합니다. 프로젝트의 규모와 목표에 맞게 필요한 기능을 요구사항으로 정의하고, 불필요한 기능들을 배제하여 비용 효율적인 외주 작업을 제공합니다. 기존 외주사들이 견적을 높이기 위해 필요 없는 기능을 추가하는 관행과는 달리, 코드스테이션은 필요한 핵심 기능에 초점을 맞춥니다.',
	},
	{
		title: '디자인',
		description:
			'코드스테이션은 창의적이고 질 높은 디자인을 제공합니다. 최신 트렌드와 사용자 경험에 대한 이해를 바탕으로 고객의 요구와 목표를 고려한 맞춤형 디자인 솔루션을 제공합니다. 브랜딩과 일관성을 유지하며, 고객과 긴밀히 협력하여 프로젝트에 적합한 디자인을 구현합니다.',
	},
	{
		title: '개발',
		description:
			'코드스테이션은 다양한 기술 스택과 개발 경험을 보유하고 있습니다. 웹 개발, 모바일 앱 개발 등 다양한 플랫폼에서 최신 프로그래밍 언어와 도구를 활용하여 소프트웨어 솔루션을 제공합니다. 고객의 요구와 목표를 이해하고, 최적의 기술적 접근 방식을 적용하여 프로젝트를 진행합니다. 또한, 품질 관리와 코드 테스트를 강조하여 안정성과 확장성을 유지합니다.',
	},
	{
		title: 'QA',
		description:
			'코드스테이션은 완성된 제품이 고객의 기대에 부합하고 높은 품질을 유지하는 것을 중요시합니다. 테스트 전략을 계획하고, 테스트 케이스를 작성하여 기능적 및 비기능적 요구사항을 검증합니다. 버그 식별과 수정을 철저히 진행하여 최상의 사용자 경험을 제공합니다. 또한, 프로젝트 진행 중에 발생하는 문제를 신속하게 해결하여 고객에게 원활한 서비스를 제공합니다.',
	},
];
